[1,["ecpdLyjvZBwrvm+cedCcQy","5cQJF+mRpLwbLz6vuT1iSK","98pI2yLrdM4Lwj+nKmTe4e","6cfLjlSjxL7rEJTWrYg2wD","19K0QaidVN4LB7/UaNfTpU","138cb7678"],["node","_spriteFrame","root","LabelVersion","imgClose","Imagebg","imgBg","data","_parent","_textureSetter"],[["cc.Node",["_name","_components","_prefab","_contentSize","_children","_anchorPoint","_parent","_trs","_color"],2,9,4,5,2,5,1,7,5],["cc.Sprite",["_type","_sizeMode","node","_materials","_spriteFrame"],1,1,3,6],["cc.Node",["_name","_parent","_components","_prefab","_contentSize","_trs"],2,1,12,4,5,7],["cc.Node",["_name","_parent","_components","_prefab","_contentSize","_children","_color","_trs"],2,1,2,4,5,2,5,7],["cc.PrefabInfo",["fileId","root","asset"],2,1,1],["cc.Label",["_fontSize","_lineHeight","_string","_N$overflow","node","_materials"],-1,1,3],"cc.SpriteFrame",["cc.Prefab",["_name"],2],["cc.Widget",["_alignFlags","_originalWidth","_originalHeight","node"],0,1],["cba8fMPHvhPfq1tP2WToIka",["node","imgBg","Imagebg","imgClose","LabelVersion"],3,1,1,1,1,1],["1ca2cqDyD1PGJ+rxyGsEoPL",["_scaleType","node"],2,1],["cc.BlockInputEvents",["node"],3,1],["cc.Layout",["_resize","_N$layoutType","node","_layoutSize"],1,1,5],["cc.Button",["node"],3,1],["cc.ScrollView",["horizontal","node","_N$content"],2,1,1],["cc.Mask",["node","_materials"],3,1,3]],[[4,0,1,2,2],[0,0,6,1,2,3,7,2],[1,2,3,1],[7,0,2],[0,0,4,1,2,3,7,2],[0,0,4,1,2,3,5,2],[0,0,6,4,1,2,3,5,7,2],[0,0,6,4,1,2,3,5,2],[0,0,6,1,2,8,3,5,2],[2,0,1,2,3,4,2],[2,0,1,2,3,4,5,2],[3,0,1,5,2,3,4,2],[3,0,1,2,3,6,4,7,2],[8,0,1,2,3,4],[9,0,1,2,3,4,1],[4,1,2,1],[10,0,1,2],[11,0,1],[12,0,1,2,3,3],[13,0,1],[14,0,1,2,2],[15,0,1,1],[1,0,1,2,3,4,3],[1,0,1,2,3,3],[1,2,3,4,1],[5,2,0,1,3,4,5,5],[5,0,1,4,5,3]],[[[[3,"SceneDoc"],[4,"SceneDoc",[-8,-9,-10,-11,-12,-13],[[13,45,1334,750,-2],[14,-7,-6,-5,-4,-3]],[15,-1,0],[5,1334,750],[667,375,0,0,0,0,1,1,1,1]],[9,"imgBg",1,[[-14,[16,1,-15],[17,-16]],1,4,4],[0,"01DgASDoxCuZ6f+d0+10L6",1,0],[5,1334,750]],[5,"content",[-18],[[18,1,2,-17,[5,1045,1926.2400000000002]]],[0,"95jd3AVp5Bbo8AUF7x0Bkr",1,0],[5,1045,1926.2400000000002],[0,0.5,1]],[11,"Imagebg",1,[-20],[-19],[0,"52ctagWO1HVIFEI7WiJF7f",1,0],[5,1194,740]],[10,"imgClose",1,[[-21,[19,-22]],1,4],[0,"cfjqWXkTBKzYj23YUF/jxM",1,0],[5,72,80],[523.861,250.542,0,0,0,0,1,1,1,1]],[6,"scroview",1,[-24],[[20,false,-23,3]],[0,"91wmYfer5NFZw0mmFIhrng",1,0],[5,1045,522],[0,0.5,1],[0,191.974,0,0,0,0,1,1,1,1]],[7,"mask",6,[3],[[21,-25,[8]]],[0,"5bBFD13k5BPKp8bkXtj9Nm",1,0],[5,1045,522],[0,0.5,1]],[2,2,[0]],[1,"Image",4,[[22,1,0,-26,[1],2]],[0,"00UIRfmjtBjquTtOIllSHp",1,0],[5,1045,522],[0,-55.314,0,0,0,0,1,1,1,1]],[23,1,0,4,[3]],[1,"Image",1,[[24,-27,[4],5]],[0,"06R5VozTtHqqqtADOOxAD0",1,0],[5,669,60],[0,289.588,0,0,0,0,1,1,1,1]],[2,5,[6]],[8,"textInfo",3,[[25,"Terms and Conditions\nArticle 1 Download,install and use\n1.By registering an account on our APP,you agree that you have understood and accepted the following terms and conditions(\"Terms\")\n2.You understand and acknowledge that the games and other services provided on the APP are for entertainment purposes only.Use of the APP for any other purpose or intent is strictly prohibited,and you acknowledge that your interest in the games and other services we provide is personal in nature.\n3.This software is free software, users can download, install and use this software non-commercially and in unlimited quantities.\n\nArticle 2 Products and Services\n1.Ace Game relies on the client to provide products or services to users.When using Ace Game products or services,users need to download the client and register an account.For the client,the Ace Game gives the user a separate,non-transferable and non-exclusive license,and the user can only use the client for the purpose of using the product or service.\n2.The user understands and agrees that Ace Game provides products or services in accordance with the status quo that the existing technology and conditions can achieve.Ace Game will do its best to ensure the continuity and security of related products or services,but Ace Game cannot foresee and prevent legal,technical and other risks at any time,and Ace Game is exempt from responsibility for such risks to the extent permitted by law,including but not Limited to service interruption,data loss,and other losses and risks that may be caused by force majeure,viruses,Troian horses,hacker attacks,system instability,third-party service defects,government actions,etc.\n3.The user understands and agrees that when using the products or services provided by Ace Game,the client application should be obtained through Ace Game or its authorized third party.If the user obtains the client from any unauthorized third party,Ace Game cannot guarantee the normal operation and use of the client, and the user shall bear all the possible losses.\n4.The user can install the client terminal on the legally controlled terminal device.Once the user starts the program in the terminal device and logs in to the account,it is deemed to be using the products or services of the world of competition.\n\nArticle 3 Account Security\n1.When registering an account,users should avoid using simple passwords with repetitive or continuous numbers, leaking account information or the verification code sent by the official game world,or engaging in any other behavior that is detrimental to the security of their account;\n2.After successfully registering as a Ace Game user,the user will have a correrponding set of user names and paddwords(hereinafter referred to as\"accounts\").Users should avoid any behavior that may cause security risks to their account,and are obliged to use the account correctly.If the account is stolen or lost due to the user's active disclosure,attack by others,etc.,the user shall be responsible for all losses and consequences,and shall be fully responsible for all losses and third-party claims arising therefrom;\n3.The user should keep the account number,password and related login information properly.If any illegal/unauthorized use of the user's own account,the client or any program of the competitive world is found to have security loopholes,they should immediately contact the web customer service or the in-client customer service.Notify the world of competition,and the world of competition will take necessary measures to protect account security based on the information provided by the user;\n\nArticle 4 Recharge Rules\n1.Ace Game provides users with the purchase service ofvirtual currency,items and resources(hereinafter referred to as \"recharge service\").Resources are for in-client usage.\n2.The user can check the account balance on the client terminal at any time.If the user has any objection to his account balance,he can raise an objection to the customer service of the official website of Ace Game or the customer service in the client.The user understands and agrees that the transaction record on the client terminal shall be used as the only valid basis for the recharge transaction.\n3.The user understands and agrees that he shall use the purchased virtual currency,items or resources in accordance with the provisions of this agreement,and shall not use it for any purpose that violates laws,regulations, policies or the provisions of this agreement.If there is any violation,Ace Game will take corresponding measures in accordance with the terms of this agreement.\n\nArticle 5.Disclaimer\n1.The user understands and agrees that the user shall be responsible for all acts performed during the direct/indirect use of Ace Game products or services and through the account.\n2.The user understands and agrees that the requirements of national laws,regulations,rules and normative documents must be abided by in the process of using the products or services provided by Ace Game,and they promise not to send or disseminate information that violates national laws and regulations and uncivilized through Ace Game information or misconduct.\n\nArticle 6 Precautions\nAce Game once again reminds you that before you accept this agreement,please read this agreement carefully and fully understand the terms and conditions,especially the terms of exempting or limiting the responsibility of Ace Game,restricting user rights,agreeing on the application of law and dispute resolution.Disclaimers,limitations,and dispute resolution and jurisdiction clauses are usually bolded,color-coded,or otherwise reasonable to draw your attention.",24,24,3,-28,[7]]],[0,"15stEVUSFFirhVr/bItAur",1,0],[4,4281493673],[5,1001,1926.2400000000002],[0,0.5,1]],[12,"LabelVersion",1,[-29],[0,"7bdMc1kXpLTKjLa7xIoQiK",1,0],[4,4290315822],[5,0,277.2],[388.112,326.582,0,0,0,0,1,1,1,1]],[26,20,220,14,[9]]],0,[0,2,1,0,0,1,0,3,15,0,4,12,0,5,10,0,6,8,0,0,1,0,-1,2,0,-2,4,0,-3,11,0,-4,5,0,-5,6,0,-6,14,0,-1,8,0,0,2,0,0,2,0,0,3,0,-1,13,0,-1,10,0,-1,9,0,-1,12,0,0,5,0,0,6,0,-1,7,0,0,7,0,0,9,0,0,11,0,0,13,0,-1,15,0,7,1,3,8,7,29],[0,0,0,0,0,0,0,0,0,0,10,12],[-1,-1,1,-1,-1,1,-1,-1,-1,-1,1,1],[0,0,1,0,0,2,0,0,0,0,3,4]],[[{"name":"Termsandconditions","rect":[3017,99,669,60],"offset":[0,0],"originalSize":[669,60],"rotated":1,"capInsets":[0,0,0,0]}],[6],0,[0],[9],[5]]]]